; ModuleID = '<stdin>'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%ident_t = type { i32, i32, i32, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@.gomp_critical_user_.reduction.var = common global [8 x i32] zeroinitializer
@q = internal global [10 x double] zeroinitializer, align 16
@qq = internal thread_local unnamed_addr global [10 x double] zeroinitializer, align 16
@x = internal thread_local global [131072 x double] zeroinitializer, align 16
@0 = private unnamed_addr constant %ident_t { i32 0, i32 2, i32 0, i32 0, i8* getelementptr inbounds ([23 x i8], [23 x i8]* @.str.6, i32 0, i32 0) }, align 8
@main.dum = private unnamed_addr constant [3 x double] [double 1.000000e+00, double 1.000000e+00, double 1.000000e+00], align 16
@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"%15.0lf\00", align 1
@str = private unnamed_addr constant [57 x i8] c"\0A\0A NAS Parallel Benchmarks (NPB3.3-OMP-C) - EP Benchmark\00"

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !8, globals: !10)
!1 = !DIFile(filename: "ep.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/EP")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 4, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../common/type.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/EP")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "false", value: 0)
!7 = !DIEnumerator(name: "true", value: 1)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !{!11, !16, !20}
!11 = distinct !DIGlobalVariable(name: "x", scope: !0, file: !1, line: 68, type: !12, isLocal: true, isDefinition: true, variable: [131072 x double]* @x)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8388608, align: 64, elements: !14)
!13 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!14 = !{!15}
!15 = !DISubrange(count: 131072)
!16 = distinct !DIGlobalVariable(name: "qq", scope: !0, file: !1, line: 69, type: !17, isLocal: true, isDefinition: true, variable: [10 x double]* @qq)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 640, align: 64, elements: !18)
!18 = !{!19}
!19 = !DISubrange(count: 10)
!20 = distinct !DIGlobalVariable(name: "q", scope: !0, file: !1, line: 71, type: !17, isLocal: true, isDefinition: true, variable: [10 x double]* @q)
!21 = distinct !DICompileUnit(language: DW_LANG_C99, file: !22, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !23, retainedTypes: !26)
!22 = !DIFile(filename: "../common/print_results.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!23 = !{!24}
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 4, size: 32, align: 32, elements: !5)
!25 = !DIFile(filename: "../common/type.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!26 = !{!13}
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !30)
!28 = !DIFile(filename: "../common/randdp.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!29 = !{}
!30 = !{!31}
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, globals: !34)
!33 = !DIFile(filename: "../common/c_timers.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!34 = !{!35, !40, !41}
!35 = distinct !DIGlobalVariable(name: "start", scope: !32, file: !36, line: 28, type: !37, isLocal: true, isDefinition: true, variable: [64 x double]* @start)
!36 = !DIFile(filename: "c_timers.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 4096, align: 64, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 64)
!40 = distinct !DIGlobalVariable(name: "elapsed", scope: !32, file: !36, line: 28, type: !37, isLocal: true, isDefinition: true, variable: [64 x double]* @elapsed)
!41 = distinct !DIGlobalVariable(name: "count", scope: !32, file: !36, line: 29, type: !42, isLocal: true, isDefinition: true, variable: [64 x i32]* @count)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, align: 32, elements: !38)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, globals: !46)
!45 = !DIFile(filename: "../common/wtime.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!46 = !{!47}
!47 = distinct !DIGlobalVariable(name: "sec", scope: !48, file: !45, line: 10, type: !31, isLocal: true, isDefinition: true, variable: i32* @wtime_.sec)
!48 = distinct !DISubprogram(name: "wtime_", scope: !45, file: !45, line: 7, type: !49, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: true, unit: !44, variables: !52)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!52 = !{!53, !54}
!53 = !DILocalVariable(name: "t", arg: 1, scope: !48, file: !45, line: 7, type: !51)
!54 = !DILocalVariable(name: "tv", scope: !48, file: !45, line: 11, type: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !56, line: 30, size: 128, align: 64, elements: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!57 = !{!58, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !55, file: !56, line: 32, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !60, line: 139, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!61 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !55, file: !56, line: 33, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !60, line: 141, baseType: !61)
!64 = !{!"clang version 3.9.1 (tags/RELEASE_391/final)"}
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 74, type: !68, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !73)
!68 = !DISubroutineType(types: !69)
!69 = !{!31, !31, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !104, !105, !109, !113}
!74 = !DILocalVariable(name: "argc", arg: 1, scope: !67, file: !1, line: 74, type: !31)
!75 = !DILocalVariable(name: "argv", arg: 2, scope: !67, file: !1, line: 74, type: !70)
!76 = !DILocalVariable(name: "Mops", scope: !67, file: !1, line: 76, type: !13)
!77 = !DILocalVariable(name: "t1", scope: !67, file: !1, line: 76, type: !13)
!78 = !DILocalVariable(name: "t2", scope: !67, file: !1, line: 76, type: !13)
!79 = !DILocalVariable(name: "t3", scope: !67, file: !1, line: 76, type: !13)
!80 = !DILocalVariable(name: "t4", scope: !67, file: !1, line: 76, type: !13)
!81 = !DILocalVariable(name: "x1", scope: !67, file: !1, line: 76, type: !13)
!82 = !DILocalVariable(name: "x2", scope: !67, file: !1, line: 76, type: !13)
!83 = !DILocalVariable(name: "sx", scope: !67, file: !1, line: 77, type: !13)
!84 = !DILocalVariable(name: "sy", scope: !67, file: !1, line: 77, type: !13)
!85 = !DILocalVariable(name: "tm", scope: !67, file: !1, line: 77, type: !13)
!86 = !DILocalVariable(name: "an", scope: !67, file: !1, line: 77, type: !13)
!87 = !DILocalVariable(name: "tt", scope: !67, file: !1, line: 77, type: !13)
!88 = !DILocalVariable(name: "gc", scope: !67, file: !1, line: 77, type: !13)
!89 = !DILocalVariable(name: "sx_verify_value", scope: !67, file: !1, line: 78, type: !13)
!90 = !DILocalVariable(name: "sy_verify_value", scope: !67, file: !1, line: 78, type: !13)
!91 = !DILocalVariable(name: "sx_err", scope: !67, file: !1, line: 78, type: !13)
!92 = !DILocalVariable(name: "sy_err", scope: !67, file: !1, line: 78, type: !13)
!93 = !DILocalVariable(name: "np", scope: !67, file: !1, line: 79, type: !31)
!94 = !DILocalVariable(name: "i", scope: !67, file: !1, line: 80, type: !31)
!95 = !DILocalVariable(name: "ik", scope: !67, file: !1, line: 80, type: !31)
!96 = !DILocalVariable(name: "kk", scope: !67, file: !1, line: 80, type: !31)
!97 = !DILocalVariable(name: "l", scope: !67, file: !1, line: 80, type: !31)
!98 = !DILocalVariable(name: "k", scope: !67, file: !1, line: 80, type: !31)
!99 = !DILocalVariable(name: "nit", scope: !67, file: !1, line: 80, type: !31)
!100 = !DILocalVariable(name: "k_offset", scope: !67, file: !1, line: 81, type: !31)
!101 = !DILocalVariable(name: "j", scope: !67, file: !1, line: 81, type: !31)
!102 = !DILocalVariable(name: "verified", scope: !67, file: !1, line: 82, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "logical", file: !4, line: 4, baseType: !3)
!104 = !DILocalVariable(name: "timers_enabled", scope: !67, file: !1, line: 82, type: !103)
!105 = !DILocalVariable(name: "dum", scope: !67, file: !1, line: 84, type: !106)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, align: 64, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 3)
!109 = !DILocalVariable(name: "size", scope: !67, file: !1, line: 85, type: !110)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 16)
!113 = !DILocalVariable(name: "fp", scope: !67, file: !1, line: 87, type: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !116, line: 48, baseType: !117)
!116 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/EP")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !118, line: 245, size: 1728, align: 64, elements: !119)
!118 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/EP")
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !140, !141, !142, !143, !146, !148, !150, !154, !157, !159, !160, !161, !162, !163, !167, !168}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !117, file: !118, line: 246, baseType: !31, size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !117, file: !118, line: 251, baseType: !71, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !117, file: !118, line: 252, baseType: !71, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !117, file: !118, line: 253, baseType: !71, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !117, file: !118, line: 254, baseType: !71, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !117, file: !118, line: 255, baseType: !71, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !117, file: !118, line: 256, baseType: !71, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !117, file: !118, line: 257, baseType: !71, size: 64, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !117, file: !118, line: 258, baseType: !71, size: 64, align: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !117, file: !118, line: 260, baseType: !71, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !117, file: !118, line: 261, baseType: !71, size: 64, align: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !117, file: !118, line: 262, baseType: !71, size: 64, align: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !117, file: !118, line: 264, baseType: !133, size: 64, align: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !118, line: 160, size: 192, align: 64, elements: !135)
!135 = !{!136, !137, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !134, file: !118, line: 161, baseType: !133, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !134, file: !118, line: 162, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !134, file: !118, line: 166, baseType: !31, size: 32, align: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !117, file: !118, line: 266, baseType: !138, size: 64, align: 64, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !117, file: !118, line: 268, baseType: !31, size: 32, align: 32, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !117, file: !118, line: 272, baseType: !31, size: 32, align: 32, offset: 928)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !117, file: !118, line: 274, baseType: !144, size: 64, align: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !145, line: 131, baseType: !61)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/EP")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !117, file: !118, line: 278, baseType: !147, size: 16, align: 16, offset: 1024)
!147 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !117, file: !118, line: 279, baseType: !149, size: 8, align: 8, offset: 1040)
!149 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !117, file: !118, line: 280, baseType: !151, size: 8, align: 8, offset: 1048)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 8, align: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 1)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !117, file: !118, line: 284, baseType: !155, size: 64, align: 64, offset: 1088)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !118, line: 154, baseType: null)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !117, file: !118, line: 293, baseType: !158, size: 64, align: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !145, line: 132, baseType: !61)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !117, file: !118, line: 302, baseType: !9, size: 64, align: 64, offset: 1216)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !117, file: !118, line: 303, baseType: !9, size: 64, align: 64, offset: 1280)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !117, file: !118, line: 304, baseType: !9, size: 64, align: 64, offset: 1344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !117, file: !118, line: 305, baseType: !9, size: 64, align: 64, offset: 1408)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !117, file: !118, line: 306, baseType: !164, size: 64, align: 64, offset: 1472)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 62, baseType: !166)
!165 = !DIFile(filename: "/home/amiryousefi/buildforinstm/bin/../lib/clang/3.9.1/include/stddef.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/EP")
!166 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !117, file: !118, line: 308, baseType: !31, size: 32, align: 32, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !117, file: !118, line: 310, baseType: !169, size: 160, align: 8, offset: 1568)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, align: 8, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 20)
!172 = !DIExpression()
!173 = !DILocation(line: 74, column: 14, scope: !67)
!174 = !DILocation(line: 74, column: 26, scope: !67)
!175 = !DILocation(line: 76, column: 3, scope: !67)
!176 = !DILocation(line: 76, column: 3, scope: !177)
!177 = !DILexicalBlockFile(scope: !67, file: !1, discriminator: 1)
!178 = !DILocation(line: 77, column: 3, scope: !67)
!179 = !DILocation(line: 77, column: 3, scope: !177)
!180 = !DILocation(line: 77, column: 3, scope: !181)
!181 = !DILexicalBlockFile(scope: !67, file: !1, discriminator: 3)
!182 = !DILocation(line: 79, column: 3, scope: !67)
!183 = !DILocation(line: 81, column: 3, scope: !67)
!184 = !DILocation(line: 82, column: 3, scope: !67)
!185 = !DILocation(line: 82, column: 3, scope: !177)
!186 = !DILocation(line: 84, column: 3, scope: !67)
!187 = !DILocation(line: 84, column: 10, scope: !67)
!188 = !DILocation(line: 84, column: 10, scope: !177)
!189 = !DILocation(line: 85, column: 3, scope: !67)
!190 = !DILocation(line: 85, column: 10, scope: !67)
!191 = !DILocation(line: 89, column: 13, scope: !192)
!192 = distinct !DILexicalBlock(scope: !67, file: !1, line: 89, column: 7)
!193 = !DILocation(line: 87, column: 9, scope: !67)
!194 = !DILocation(line: 89, column: 39, scope: !192)
!195 = !DILocation(line: 89, column: 7, scope: !67)
!196 = !DILocation(line: 82, column: 21, scope: !67)
!197 = !DILocation(line: 90, column: 20, scope: !198)
!198 = distinct !DILexicalBlock(scope: !192, file: !1, line: 89, column: 48)
!199 = !{!200, !200, i64 0}
!200 = !{!"omnipotent char", !201, i64 0}
!201 = !{!"Simple C/C++ TBAA"}
!202 = !DILocation(line: 91, column: 3, scope: !198)
!203 = !DILocation(line: 92, column: 20, scope: !204)
!204 = distinct !DILexicalBlock(scope: !192, file: !1, line: 91, column: 10)
!205 = !DILocation(line: 93, column: 5, scope: !204)
!206 = !DILocation(line: 103, column: 28, scope: !67)
!207 = !DILocation(line: 103, column: 3, scope: !177)
!208 = !DILocation(line: 81, column: 20, scope: !67)
!209 = !DILocation(line: 105, column: 7, scope: !210)
!210 = distinct !DILexicalBlock(scope: !67, file: !1, line: 105, column: 7)
!211 = !DILocation(line: 105, column: 15, scope: !210)
!212 = !DILocation(line: 105, column: 7, scope: !67)
!213 = !DILocation(line: 106, column: 3, scope: !67)
!214 = !DILocation(line: 106, column: 13, scope: !67)
!215 = !DILocation(line: 107, column: 3, scope: !67)
!216 = !DILocation(line: 108, column: 3, scope: !67)
!217 = !DILocation(line: 109, column: 61, scope: !67)
!218 = !DILocation(line: 109, column: 3, scope: !177)
!219 = !DILocation(line: 82, column: 11, scope: !67)
!220 = !DILocation(line: 79, column: 10, scope: !67)
!221 = !DILocation(line: 119, column: 6, scope: !67)
!222 = !{!223, !223, i64 0}
!223 = !{!"int", !200, i64 0}
!224 = !DILocation(line: 128, column: 14, scope: !67)
!225 = !DILocation(line: 128, column: 22, scope: !67)
!226 = !DILocation(line: 128, column: 31, scope: !67)
!227 = !DILocation(line: 128, column: 3, scope: !67)
!228 = !DILocation(line: 129, column: 28, scope: !67)
!229 = !{!230, !230, i64 0}
!230 = !{!"double", !200, i64 0}
!231 = !DILocation(line: 129, column: 12, scope: !67)
!232 = !DILocation(line: 129, column: 10, scope: !67)
!233 = !DILocation(line: 130, column: 11, scope: !67)
!234 = !DILocation(line: 136, column: 14, scope: !177)
!235 = !DILocation(line: 136, column: 10, scope: !236)
!236 = !DILexicalBlockFile(scope: !67, file: !1, discriminator: 2)
!237 = !DILocation(line: 76, column: 10, scope: !67)
!238 = !DILocation(line: 138, column: 11, scope: !67)
!239 = !DIExpression(DW_OP_deref)
!240 = !DILocation(line: 144, column: 3, scope: !67)
!241 = !DILocation(line: 76, column: 16, scope: !67)
!242 = !DILocation(line: 146, column: 6, scope: !67)
