; ModuleID = '<stdin>'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%ident_t = type { i32, i32, i32, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@.gomp_critical_user_.reduction.var = common global [8 x i32] zeroinitializer
@last_n = internal global [1025 x i32] zeroinitializer, align 16
@tran = internal thread_local global double 0.000000e+00, align 8
@amult = internal thread_local unnamed_addr global double 0.000000e+00, align 8
@ihigh = internal thread_local unnamed_addr global i32 0, align 4
@ilow = internal thread_local unnamed_addr global i32 0, align 4
@num_threads = internal thread_local unnamed_addr global i32 0, align 4
@myid = internal thread_local unnamed_addr global i32 0, align 4
@r = internal global [1402 x double] zeroinitializer, align 16
@q = internal global [1402 x double] zeroinitializer, align 16
@p = internal global [1402 x double] zeroinitializer, align 16
@z = internal global [1402 x double] zeroinitializer, align 16
@x = internal global [1402 x double] zeroinitializer, align 16
@a = internal global [89600 x double] zeroinitializer, align 16

!50 = distinct !DIGlobalVariable(name: "num_threads", scope: !0, file: !1, line: 71, type: !12, isLocal: true, isDefinition: true, variable: i32* @num_threads)
!51 = distinct !DIGlobalVariable(name: "ilow", scope: !0, file: !1, line: 71, type: !12, isLocal: true, isDefinition: true, variable: i32* @ilow)
!52 = distinct !DIGlobalVariable(name: "ihigh", scope: !0, file: !1, line: 71, type: !12, isLocal: true, isDefinition: true, variable: i32* @ihigh)
!53 = distinct !DIGlobalVariable(name: "naa", scope: !0, file: !1, line: 78, type: !12, isLocal: true, isDefinition: true)
!54 = distinct !DIGlobalVariable(name: "nzz", scope: !0, file: !1, line: 79, type: !12, isLocal: true, isDefinition: true)
!55 = distinct !DIGlobalVariable(name: "firstrow", scope: !0, file: !1, line: 80, type: !12, isLocal: true, isDefinition: true)
!56 = distinct !DIGlobalVariable(name: "lastrow", scope: !0, file: !1, line: 81, type: !12, isLocal: true, isDefinition: true)
!57 = distinct !DIGlobalVariable(name: "firstcol", scope: !0, file: !1, line: 82, type: !12, isLocal: true, isDefinition: true)
!58 = distinct !DIGlobalVariable(name: "lastcol", scope: !0, file: !1, line: 83, type: !12, isLocal: true, isDefinition: true)
!59 = distinct !DIGlobalVariable(name: "amult", scope: !0, file: !1, line: 86, type: !17, isLocal: true, isDefinition: true, variable: double* @amult)
!60 = distinct !DIGlobalVariable(name: "tran", scope: !0, file: !1, line: 87, type: !17, isLocal: true, isDefinition: true, variable: double* @tran)
!61 = distinct !DIGlobalVariable(name: "timeron", scope: !0, file: !1, line: 91, type: !62, isLocal: true, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "logical", file: !4, line: 4, baseType: !3)
!63 = distinct !DIGlobalVariable(name: "last_n", scope: !0, file: !1, line: 75, type: !64, isLocal: true, isDefinition: true, variable: [1025 x i32]* @last_n)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32800, align: 32, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 1025)
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !72)
!68 = !DIFile(filename: "../common/print_results.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!69 = !{!70}
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 4, size: 32, align: 32, elements: !5)
!71 = !DIFile(filename: "../common/type.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!72 = !{!17}
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !75, retainedTypes: !76)
!74 = !DIFile(filename: "../common/randdp.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!75 = !{}
!76 = !{!12}
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !75, globals: !79)
!78 = !DIFile(filename: "../common/c_timers.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!79 = !{!80, !85, !86}
!80 = distinct !DIGlobalVariable(name: "start", scope: !77, file: !81, line: 28, type: !82, isLocal: true, isDefinition: true, variable: [64 x double]* @start)
!81 = !DIFile(filename: "c_timers.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 4096, align: 64, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 64)
!85 = distinct !DIGlobalVariable(name: "elapsed", scope: !77, file: !81, line: 28, type: !82, isLocal: true, isDefinition: true, variable: [64 x double]* @elapsed)
!86 = distinct !DIGlobalVariable(name: "count", scope: !77, file: !81, line: 29, type: !87, isLocal: true, isDefinition: true, variable: [64 x i32]* @count)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, align: 32, elements: !83)
!88 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!89 = distinct !DICompileUnit(language: DW_LANG_C99, file: !90, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !75, globals: !91)
!90 = !DIFile(filename: "../common/wtime.c", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!91 = !{!92}
!92 = distinct !DIGlobalVariable(name: "sec", scope: !93, file: !90, line: 10, type: !12, isLocal: true, isDefinition: true, variable: i32* @wtime_.sec)
!93 = distinct !DISubprogram(name: "wtime_", scope: !90, file: !90, line: 7, type: !94, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: true, unit: !89, variables: !97)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!97 = !{!98, !99}
!98 = !DILocalVariable(name: "t", arg: 1, scope: !93, file: !90, line: 7, type: !96)
!99 = !DILocalVariable(name: "tv", scope: !93, file: !90, line: 11, type: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !101, line: 30, size: 128, align: 64, elements: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!102 = !{!103, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !100, file: !101, line: 32, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !105, line: 139, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/common")
!106 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !100, file: !101, line: 33, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !105, line: 141, baseType: !106)
!109 = !{!"clang version 3.9.1 (tags/RELEASE_391/final)"}
!110 = !{i32 2, !"Dwarf Version", i32 4}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 142, type: !113, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !118)
!113 = !DISubroutineType(types: !114)
!114 = !{!12, !12, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !141}
!119 = !DILocalVariable(name: "argc", arg: 1, scope: !112, file: !1, line: 142, type: !12)
!120 = !DILocalVariable(name: "argv", arg: 2, scope: !112, file: !1, line: 142, type: !115)
!121 = !DILocalVariable(name: "i", scope: !112, file: !1, line: 145, type: !12)
!122 = !DILocalVariable(name: "j", scope: !112, file: !1, line: 145, type: !12)
!123 = !DILocalVariable(name: "k", scope: !112, file: !1, line: 145, type: !12)
!124 = !DILocalVariable(name: "it", scope: !112, file: !1, line: 145, type: !12)
!125 = !DILocalVariable(name: "zeta", scope: !112, file: !1, line: 147, type: !17)
!126 = !DILocalVariable(name: "rnorm", scope: !112, file: !1, line: 148, type: !17)
!127 = !DILocalVariable(name: "norm_temp1", scope: !112, file: !1, line: 149, type: !17)
!128 = !DILocalVariable(name: "norm_temp2", scope: !112, file: !1, line: 149, type: !17)
!129 = !DILocalVariable(name: "t", scope: !112, file: !1, line: 151, type: !17)
!130 = !DILocalVariable(name: "mflops", scope: !112, file: !1, line: 151, type: !17)
!131 = !DILocalVariable(name: "tmax", scope: !112, file: !1, line: 151, type: !17)
!132 = !DILocalVariable(name: "Class", scope: !112, file: !1, line: 152, type: !117)
!133 = !DILocalVariable(name: "verified", scope: !112, file: !1, line: 153, type: !62)
!134 = !DILocalVariable(name: "zeta_verify_value", scope: !112, file: !1, line: 154, type: !17)
!135 = !DILocalVariable(name: "epsilon", scope: !112, file: !1, line: 154, type: !17)
!136 = !DILocalVariable(name: "err", scope: !112, file: !1, line: 154, type: !17)
!137 = !DILocalVariable(name: "t_names", scope: !112, file: !1, line: 156, type: !138)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 192, align: 64, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 3)
!141 = !DILocalVariable(name: "fp", scope: !112, file: !1, line: 162, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !144, line: 48, baseType: !145)
!144 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/CG")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !146, line: 245, size: 1728, align: 64, elements: !147)
!146 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/CG")
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !168, !169, !170, !171, !174, !176, !178, !182, !185, !187, !188, !189, !190, !191, !195, !196}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !145, file: !146, line: 246, baseType: !12, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !145, file: !146, line: 251, baseType: !116, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !145, file: !146, line: 252, baseType: !116, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !145, file: !146, line: 253, baseType: !116, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !145, file: !146, line: 254, baseType: !116, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !145, file: !146, line: 255, baseType: !116, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !145, file: !146, line: 256, baseType: !116, size: 64, align: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !145, file: !146, line: 257, baseType: !116, size: 64, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !145, file: !146, line: 258, baseType: !116, size: 64, align: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !145, file: !146, line: 260, baseType: !116, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !145, file: !146, line: 261, baseType: !116, size: 64, align: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !145, file: !146, line: 262, baseType: !116, size: 64, align: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !145, file: !146, line: 264, baseType: !161, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !146, line: 160, size: 192, align: 64, elements: !163)
!163 = !{!164, !165, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !162, file: !146, line: 161, baseType: !161, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !162, file: !146, line: 162, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !162, file: !146, line: 166, baseType: !12, size: 32, align: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !145, file: !146, line: 266, baseType: !166, size: 64, align: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !145, file: !146, line: 268, baseType: !12, size: 32, align: 32, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !145, file: !146, line: 272, baseType: !12, size: 32, align: 32, offset: 928)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !145, file: !146, line: 274, baseType: !172, size: 64, align: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !173, line: 131, baseType: !106)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/CG")
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !145, file: !146, line: 278, baseType: !175, size: 16, align: 16, offset: 1024)
!175 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !145, file: !146, line: 279, baseType: !177, size: 8, align: 8, offset: 1040)
!177 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !145, file: !146, line: 280, baseType: !179, size: 8, align: 8, offset: 1048)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 8, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !145, file: !146, line: 284, baseType: !183, size: 64, align: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !146, line: 154, baseType: null)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !145, file: !146, line: 293, baseType: !186, size: 64, align: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !173, line: 132, baseType: !106)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !145, file: !146, line: 302, baseType: !9, size: 64, align: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !145, file: !146, line: 303, baseType: !9, size: 64, align: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !145, file: !146, line: 304, baseType: !9, size: 64, align: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !145, file: !146, line: 305, baseType: !9, size: 64, align: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !145, file: !146, line: 306, baseType: !192, size: 64, align: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !193, line: 62, baseType: !194)
!193 = !DIFile(filename: "/home/amiryousefi/buildforinstm/bin/../lib/clang/3.9.1/include/stddef.h", directory: "/home/amiryousefi/MasterThesis/Codes/NAS/NPB3.3-OMP-C/CG")
!194 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !145, file: !146, line: 308, baseType: !12, size: 32, align: 32, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !145, file: !146, line: 310, baseType: !197, size: 160, align: 8, offset: 1568)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 160, align: 8, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 20)
!200 = !DIExpression()
!201 = !DILocation(line: 142, column: 15, scope: !112)
!202 = !DILocation(line: 142, column: 27, scope: !112)
!203 = !DILocation(line: 144, column: 3, scope: !112)
!204 = !DILocation(line: 149, column: 3, scope: !112)
!205 = !DILocation(line: 149, column: 3, scope: !206)
!206 = !DILexicalBlockFile(scope: !112, file: !1, discriminator: 1)
!207 = !DILocation(line: 156, column: 3, scope: !112)
!208 = !DILocation(line: 156, column: 9, scope: !112)
!209 = !DILocation(line: 145, column: 7, scope: !112)
!210 = !DILocation(line: 159, column: 5, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !1, line: 158, column: 32)
!212 = distinct !DILexicalBlock(scope: !213, file: !1, line: 158, column: 3)
!213 = distinct !DILexicalBlock(scope: !112, file: !1, line: 158, column: 3)
!214 = !DILocation(line: 163, column: 13, scope: !215)
!215 = distinct !DILexicalBlock(scope: !112, file: !1, line: 163, column: 7)
!216 = !DILocation(line: 162, column: 9, scope: !112)
!217 = !DILocation(line: 163, column: 39, scope: !215)
!218 = !DILocation(line: 163, column: 7, scope: !112)
!219 = !DILocation(line: 165, column: 21, scope: !220)
!220 = distinct !DILexicalBlock(scope: !215, file: !1, line: 163, column: 48)
!221 = !{!222, !222, i64 0}
!222 = !{!"any pointer", !223, i64 0}
!223 = !{!"omnipotent char", !224, i64 0}
!224 = !{!"Simple C/C++ TBAA"}
!225 = !DILocation(line: 167, column: 5, scope: !220)
!226 = !DILocation(line: 167, column: 26, scope: !220)
!227 = !DILocation(line: 168, column: 5, scope: !220)
!228 = !DILocation(line: 169, column: 3, scope: !220)
!229 = !DILocation(line: 173, column: 3, scope: !112)
!230 = !DILocation(line: 152, column: 8, scope: !112)
!231 = !DILocation(line: 154, column: 10, scope: !112)
!232 = !DILocation(line: 207, column: 3, scope: !112)
!233 = !DILocation(line: 208, column: 3, scope: !112)
!234 = !DILocation(line: 209, column: 3, scope: !112)
!235 = !DILocation(line: 210, column: 49, scope: !112)
!236 = !DILocation(line: 210, column: 3, scope: !206)
!237 = !DILocation(line: 211, column: 3, scope: !112)
!238 = !DILocation(line: 219, column: 11, scope: !112)
!239 = !DILocation(line: 271, column: 3, scope: !112)
!240 = !DILocation(line: 147, column: 10, scope: !112)
!241 = !DILocation(line: 145, column: 16, scope: !112)
!242 = !DILocation(line: 283, column: 5, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !1, line: 279, column: 31)
!244 = distinct !DILexicalBlock(scope: !245, file: !1, line: 279, column: 3)
!245 = distinct !DILexicalBlock(scope: !112, file: !1, line: 279, column: 3)
!246 = !DILocation(line: 461, column: 3, scope: !247, inlinedAt: !272)
!247 = distinct !DISubprogram(name: "conj_grad", scope: !1, file: !1, line: 449, type: !248, isLocal: true, isDefinition: true, scopeLine: 458, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !251)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !250, !250, !96, !96, !96, !96, !96, !96, !96}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!252 = !DILocalVariable(name: "colidx", arg: 1, scope: !247, file: !1, line: 449, type: !250)
!253 = !DILocalVariable(name: "rowstr", arg: 2, scope: !247, file: !1, line: 450, type: !250)
!254 = !DILocalVariable(name: "x", arg: 3, scope: !247, file: !1, line: 451, type: !96)
!255 = !DILocalVariable(name: "z", arg: 4, scope: !247, file: !1, line: 452, type: !96)
!256 = !DILocalVariable(name: "a", arg: 5, scope: !247, file: !1, line: 453, type: !96)
!257 = !DILocalVariable(name: "p", arg: 6, scope: !247, file: !1, line: 454, type: !96)
